app/controllers/entregas_controller.rb

SELECT * FROM `revistas` ORDER BY ano DESC, mes DESC LIMIT 1
---
  def new
    @entrega = Entrega.new
    @entrega.vendedor = @vendedor
    @entrega.revista = Revista.last

SELECT * FROM `revistas` WHERE (`revistas`.`numero` = '16') LIMIT 1
INSERT INTO `entregas` (`created_at`, `cantidad_pagas`, `updated_at`, `revista_id`, `costo`, `pago`, `vendedor_id`, `promocion_id`, `cantidad_gratis`) VALUES('2009-10-27 02:08:07', 0, '2009-10-27 02:08:07', 2, 0.0, 0.0, 2, 5, 10)
INSERT INTO `revistas` (`created_at`, `ano`, `updated_at`, `stock`, `valor`, `mes`, `numero`) VALUES('2009-10-27 20:23:35', 2009, '2009-10-27 20:23:35', 0, 0.9, 9, 15)
INSERT INTO `vendedores` (`personal_inscripcion`, `created_at`, `nombre`, `updated_at`, `provincia_id`, `fecha_nacimiento`, `fecha_inscripcion`, `sexo`, `pais_id`, `credencial`, `apellido`) VALUES('Pepe Pompin', '2009-10-27 20:23:36', 'Oscar', '2009-10-27 20:23:36', 9, '1987-05-01 00:00:00', '2009-10-27 18:23:36', 'Varon', 1, 521, 'Galvez')
UPDATE `revistas` SET `updated_at` = '2009-10-27 02:08:07', `stock` = -10 WHERE `id` = 2
---
  def create
    if params[:entrega].has_key? :pago
      params[:entrega][:pago] = cadena_a_decimal(params[:entrega][:pago])
    end
    @entrega = Entrega.new(params[:entrega])
    @entrega.vendedor = @vendedor
    @entrega.revista = Revista.find_by_numero(params[:revista][:numero])

    if @entrega.save