app/controllers/revistas_controller.rb

SELECT * FROM `revistas`
---
  def index
    @revistas = Revista.all

INSERT INTO `revistas` (`created_at`, `ano`, `updated_at`, `stock`, `valor`, `mes`, `numero`) VALUES('2009-10-27 17:41:31', 2009, '2009-10-27 17:41:31', 0, 0.9, 11, 17)
---
  def create
    @revista = Revista.new(params[:revista])

    if @revista.save!

SELECT * FROM `revistas` WHERE (`revistas`.`id` = 1)
---
  def show
    @revista = Revista.find(params[:id])

SELECT * FROM `revistas` WHERE (`revistas`.`id` = 1)
---
  def edit
    @revista = Revista.find(params[:id])

SELECT * FROM `revistas` WHERE (`revistas`.`id` = 1)
UPDATE `revistas` SET `updated_at` = '2009-10-28 18:44:29', `stock` = 15 WHERE `id` = 1
---
  def update
    @revista = Revista.find(params[:id])

    if @revista.update_attributes(params[:revista])